# 1. 查找指定元素在列表中第一次出现的下标，返回值是元素下标
# fruits = ['香蕉', '苹果', '橙子', '香蕉']
# result = fruits.index('苹果')
# print(result)  # 0

# 2. 统计某个元素在列表中出现的次数，返回值是元素出现的次数
# nums = [10, 20, 10, 30, 10, 40]
# res = nums.count(10)
# print(res)

# 3. 反转列表（会改变原列表），无需参数，无返回值
# nums = [11, 22, 33, 44, 55, 66, 77, 88, 99]
# nums.reverse()
# print(nums)

# 4. 对列表排序（从小到大，会改变原列表），reverse 用于控制排序方式，无返回值
# 4.1 若列表中的元素：都是数字，则按照数字的大小顺序进行排序
# nums = [221, 90, 19, 28, 87, 300, 199]
# nums.sort(reverse=True)
# print(nums)

# 4.2 若列表中的元素：既有数字，又有字符串，那就会报错
# nums = [221, 90, 19, 28, 87, 300, 199, '尚硅谷']
# nums.sort()
# print(nums)

# 4.3 若列表中的元素：都是字符串，则按照字符串的 Unicode 编码大小进行排序
msg_list = ['北京', '北硅谷', '北好']
msg_list.sort()
print(msg_list)  # ['北京', '北好', '北硅谷']
print(ord('京'), ord('好'), ord('硅'))